Tekla Open API Reference for Tekla Structures 2025
IntList.IndexOf Method
Overload List
Name | Description
IndexOf(Int32)
 Gets the index of the specified integer.
IndexOf(Int32, Int32)
 Gets the index of the specified integer between the index to start the search from and the end of the list.
IndexOf(Int32, Int32, Int32)
 Gets the index of the specified integer between the index to start the search from and startIndex + count.
Top
See Also
Reference
IntList Class
Tekla.Structures.Drawing Namespace